In [1]:
import pandas as pd

data = {'nama':['didi kempot', 'gren fedly', 'mbah surip'], 'tempat_kelahiran':['surakarta, jawa tengah', 'jakarta, DKI Jakarta',
                                                                               'Mojokerto, Jawa Timur']}
df = pd.DataFrame(data)
df

          nama        tempat_kelahiran
0  didi kempot  surakarta, jawa tengah
1   gren fedly    jakarta, DKI Jakarta
2   mbah surip   Mojokerto, Jawa Timur

In [2]:
df[['nama depan', 'nama belakang']] = df['nama'].str.split(' ', expand=True)
df

          nama        tempat_kelahiran nama depan nama belakang
0  didi kempot  surakarta, jawa tengah       didi        kempot
1   gren fedly    jakarta, DKI Jakarta       gren         fedly
2   mbah surip   Mojokerto, Jawa Timur       mbah         surip

In [4]:
df[['kota', 'propinsi']] = df['tempat_kelahiran'].str.split(',', expand=True)
df

,nama,tempat_kelahiran,nama depan,nama belakang,kota,propinsi
0,didi kempot,"surakarta, jawa tengah",didi,kempot,surakarta,jawa tengah
1,gren fedly,"jakarta, DKI Jakarta",gren,fedly,jakarta,DKI Jakarta
2,mbah surip,"Mojokerto, Jawa Timur",mbah,surip,Mojokerto,Jawa Timur